from fault_tree import generate_fault_tree

if __name__ == '__main__':

    # ========================== DATA ==========================


    G = {
        '1': ['2', '3'],
        '2': ['4'],
        '3': ['5'],
        '4': ['6', '7'],
        '5': ['7'],
        '6': ['8'],
        '7': ['8'],
        '8': []
    }

    names = {
        'system': '"Система очистки воздуха"',
        '1': '"Фильтр грубой очистки"',
        '2': '"Центробежный вентилятор №1"',
        '3': '"Центробежный вентилятор №2"',
        '4': '"Фильтр мелкой очистки №1"',
        '5': '"Фильтр мелкой очистки №2"',
        '6': '"Обеззараживатель №1"',
        '7': '"Обеззараживатель №2"',
        '8': '"Распределитель чистого воздуха"',
    }

    reasons = {
        'r_1': ['Заблокирован', 'Пробоина'],
        'r_2': ['Отсутствие питания'],
        'r_3': ['Отсутствие питания'],
        'r_4': ['Сильно загрязнен'],
        'r_5': ['Сильно загрязнен'],
        'r_6': ['Неисправность УФ ламп', 'Отсутствие питания'],
        'r_7': ['Неисправность УФ ламп', 'Отсутствие питания'],
        'r_8': ['Пробоина'],
    }

    # ==========================================================

    generate_fault_tree(G, names, reasons)